app/controllers/stores_controller.rb

SELECT `stores`.* FROM `stores` WHERE `stores`.`id` = 1 LIMIT 1
---
  def set_store
    @store = Store.find(params[:id])